from flask import Flask, request, jsonify
from sentence_transformers import SentenceTransformer
from konlpy.tag import Okt

# Flask 앱 생성
app = Flask(__name__)

# SentenceTransformer 모델 로드
model = SentenceTransformer('jhgan/ko-sroberta-multitask')

# Okt 로드
okt = Okt()

#   # 광역시 이름 변환 사전
# province_mapping = {
#     "서울": "서울특별시",
#     "부산": "부산광역시",
#     "대구": "대구광역시",
#     "인천": "인천광역시",
#     "광주": "광주광역시",
#     "대전": "대전광역시",
#     "울산": "울산광역시"
# }

# 지역 데이터
korea_data = {
    "서울": {
        "종로구": [
            "청운동", "신교동", "궁정동", "효자동", "창성동", "통의동", "적선동", "통인동",
            "누상동", "누하동", "옥인동", "체부동", "필운동", "내자동", "사직동", "도렴동",
            "당주동", "내수동", "세종로", "신문로1가", "신문로2가", "청진동", "서린동", "수송동",
            "중학동", "종로1가", "공평동", "관훈동", "견지동", "와룡동", "권농동", "운니동",
            "익선동", "경운동", "관철동", "인사동", "낙원동", "종로2가", "팔판동", "삼청동",
            "안국동", "소격동", "화동", "사간동", "송현동", "가회동", "재동", "계동", "원서동",
            "훈정동", "묘동", "봉익동", "돈의동", "장사동", "관수동", "종로3가", "인의동",
            "예지동", "원남동", "연지동", "종로4가", "효제동", "종로5가", "종로6가", "이화동",
            "연건동", "충신동", "동숭동", "혜화동", "명륜1가", "명륜2가", "명륜4가", "명륜3가",
            "창신동", "숭인동", "교남동", "평동", "송월동", "홍파동", "교북동", "행촌동", "구기동",
            "평창동", "부암동", "홍지동", "신영동", "무악동"
        ],
        "중구": [
            "무교동", "다동", "태평로1가", "을지로1가", "을지로2가", "남대문로1가", "삼각동",
            "수하동", "장교동", "수표동", "소공동", "남창동", "북창동", "태평로2가", "남대문로2가",
            "남대문로3가", "남대문로4가", "남대문로5가", "봉래동1가", "봉래동2가", "회현동1가",
            "회현동2가", "회현동3가", "충무로1가", "충무로2가", "명동1가", "명동2가", "남산동1가",
            "남산동2가", "남산동3가", "저동1가", "충무로4가", "충무로5가", "인현동2가", "예관동",
            "묵정동", "필동1가", "필동2가", "필동3가", "남학동", "주자동", "예장동", "장충동1가",
            "장충동2가", "광희동1가", "광희동2가", "쌍림동", "을지로6가", "을지로7가", "을지로4가",
            "을지로5가", "주교동", "방산동", "오장동", "을지로3가", "입정동", "산림동", "충무로3가",
            "초동", "인현동1가", "저동2가", "신당동", "흥인동", "무학동", "황학동", "서소문동",
            "정동", "순화동", "의주로1가", "충정로1가", "중림동", "의주로2가", "만리동1가",
            "만리동2가"
        ],
        "용산구": [
            "후암동", "용산동2가", "용산동4가", "갈월동", "남영동", "용산동1가", "동자동",
            "서계동", "청파동1가", "청파동2가", "청파동3가", "원효로1가", "원효로2가", "신창동",
            "산천동", "청암동", "원효로3가", "원효로4가", "효창동", "도원동", "용문동", "문배동",
            "신계동", "한강로1가", "한강로2가", "용산동3가", "용산동5가", "한강로3가", "이촌동",
            "이태원동", "한남동", "동빙고동", "서빙고동", "주성동", "용산동6가", "보광동"
        ],
        "성동구": [
            "상왕십리동", "하왕십리동", "홍익동", "도선동", "마장동", "사근동", "행당동", "응봉동",
            "금호동1가", "금호동2가", "금호동3가", "금호동4가", "옥수동", "성수동1가", "성수동2가",
            "성수동","송정동", "용답동"
        ],
        "광진구": [
            "중곡동", "능동", "구의동", "광장동", "자양동", "화양동", "군자동"
        ],
        "동대문구": [
        "신설동", "용두동", "제기동", "전농동", "답십리동", "장안동", "청량리동", "회기동", "휘경동", "이문동"
        ],
        "중랑구": [
            "면목동", "상봉동", "중화동", "묵동", "망우동", "신내동"
        ],
        "성북구": [
            "성북동", "성북동1가", "돈암동", "동소문동1가", "동소문동2가", "동소문동3가", "동소문동4가", "동소문동5가", 
            "동소문동6가", "동소문동7가", "삼선동1가", "삼선동2가", "삼선동3가", "삼선동4가", "삼선동5가", 
            "동선동1가", "동선동2가", "동선동3가", "동선동4가", "동선동5가", "안암동1가", "안암동2가", "안암동3가", 
            "안암동4가", "안암동5가", "보문동4가", "보문동5가", "보문동6가", "보문동7가", "보문동1가", "보문동2가", 
            "보문동3가", "정릉동", "길음동", "종암동", "하월곡동", "상월곡동", "장위동", "석관동"
        ],
         "강북구": [
            "미아동", "번동", "수유동", "우이동"
        ],
        "도봉구": [
            "쌍문동", "방학동", "창동", "도봉동"
        ],
        "노원구": [
            "월계동", "공릉동", "하계동", "상계동", "중계동"
        ],
        "은평구": [
            "수색동", "녹번동", "불광동", "갈현동", "구산동", "대조동", "응암동", "역촌동", "신사동", "증산동", 
            "진관동"
        ],
        "서대문구": [
            "충정로2가", "충정로3가", "합동", "미근동", "냉천동", "천연동", "옥천동", "영천동", "현저동", 
            "북아현동", "홍제동", "대현동", "대신동", "신촌동", "봉원동", "창천동", "연희동", "홍은동", 
            "북가좌동", "남가좌동"
        ],
        "마포구": [
            "아현동", "공덕동", "신공덕동", "도화동", "용강동", "토정동", "마포동", "대흥동", "염리동", 
            "노고산동", "신수동", "현석동", "구수동", "창전동", "상수동", "하중동", "신정동", "당인동", 
            "서교동", "동교동", "합정동", "망원동", "연남동", "성산동", "중동", "상암동"
        ],
        "양천구": [
            "신정동", "목동", "신월동"
        ],
        "강서구": [
            "염창동", "등촌동", "화곡동", "가양동", "마곡동", "내발산동", "외발산동", "공항동", "방화동", 
            "개화동", "과해동", "오곡동", "오쇠동"
        ],
        "구로구": [
            "신도림동", "구로동", "가리봉동", "고척동", "개봉동", "오류동", "궁동", "온수동", "천왕동", "항동"
        ],
        "금천구": [
            "가산동", "독산동", "시흥동"
        ],
        "영등포구": [
            "영등포동", "영등포동1가", "영등포동2가", "영등포동3가", "영등포동4가", "영등포동5가", "영등포동6가", 
            "영등포동7가", "영등포동8가", "여의도동", "당산동1가", "당산동2가", "당산동3가", "당산동4가", 
            "당산동5가", "당산동6가", "당산동", "도림동", "문래동1가", "문래동2가", "문래동3가", "문래동4가", 
            "문래동5가", "문래동6가", "양평동1가", "양평동2가", "양평동3가", "양평동4가", "양평동5가", "양평동6가", 
            "양화동", "신길동", "대림동"
        ],
        "동작구": [
            "노량진동", "상도동", "상도1동", "본동", "흑석동", "동작동", "사당동", "대방동", "신대방동"
        ],
        "관악구": [
            "봉천동", "신림동", "남현동"
        ],
        "서초구": [
            "방배동", "양재동", "우면동", "원지동", "도곡동", "잠원동", "반포동", "서초동", "내곡동", 
            "염곡동", "신원동"
        ],
        "강남구": [
            "역삼동", "개포동", "청담동", "삼성동", "대치동", "신사동", "논현동", "압구정동", "세곡동",
            "자곡동", "율현동", "일원동", "수서동", "도곡동"
        ],
        "송파구": [
            "잠실동", "신천동", "풍납동", "송파동", "석촌동", "삼전동", "가락동", "문정동", "장지동",
            "방이동", "오금동", "거여동", "마천동"
        ],
        "강동구": [
            "명일동", "고덕동", "상일동", "길동", "둔촌동", "암사동", "성내동", "천호동", "강일동"
        ]
    },
    "부산": {
        "중구": [
        "영주동", "대창동1가", "대창동2가", "중앙동1가", "중앙동2가", "중앙동3가", "중앙동4가",
        "중앙동5가", "중앙동6가", "중앙동7가", "동광동1가", "동광동2가", "동광동3가",
        "동광동4가", "동광동5가", "대청동1가", "대청동2가", "대청동3가", "대청동4가",
        "보수동1가", "보수동2가", "보수동3가", "부평동1가", "부평동2가", "부평동3가",
        "부평동4가", "신창동1가", "신창동2가", "신창동3가", "신창동4가", "창선동1가",
        "창선동2가", "광복동1가", "광복동2가", "광복동3가", "남포동1가", "남포동2가",
        "남포동3가", "남포동4가", "남포동5가", "남포동6가"
        ],
        "서구": [
            "동대신동1가", "동대신동2가", "동대신동3가", "서대신동1가", "서대신동2가",
            "서대신동3가", "부용동1가", "부용동2가", "부민동1가", "부민동2가",
            "부민동3가", "토성동1가", "토성동2가", "토성동3가", "아미동1가",
            "아미동2가", "토성동4가", "토성동5가", "초장동", "충무동1가",
            "충무동2가", "충무동3가", "남부민동", "암남동"
        ],
        "동구": [
            "초량동", "수정동", "좌천동", "범일동"
        ],
        "영도구": [
            "대교동1가", "대교동2가", "대평동1가", "대평동2가", "남항동1가",
            "남항동2가", "남항동3가", "영선동1가", "영선동2가", "영선동3가",
            "영선동4가", "신선동1가", "신선동2가", "신선동3가", "봉래동1가",
            "봉래동2가", "봉래동3가", "봉래동4가", "봉래동5가", "청학동",
            "동삼동"
        ],
        "부산진구": [
            "양정동", "전포동", "부전동", "범천동", "범전동", "연지동", "초읍동",
            "부암동", "당감동", "가야동", "개금동"
        ],
        "동래구": [
            "명장동", "안락동", "칠산동", "낙민동", "복천동", "수안동",
            "명륜동", "온천동", "사직동"
        ],
        "남구": [
            "대연동", "용호동", "용당동", "문현동", "우암동", "감만동"
        ],
        "북구": [
            "금곡동", "화명동", "만덕동", "덕천동", "구포동"
        ],
        "해운대구": [
        "반송동", "석대동", "반여동", "재송동", "우동", "중동",
        "좌동", "송정동"
        ],
        "사하구": [
            "괴정동", "당리동", "하단동", "신평동", "장림동", "다대동",
            "구평동", "감천동"
        ],
        "금정구": [
            "두구동", "노포동", "청룡동", "남산동", "선동", "오륜동",
            "구서동", "장전동", "부곡동", "서동", "금사동", "회동동",
            "금성동"
        ],
        "강서구": [
            "대저1동", "대저2동", "강동동", "명지동", "죽림동", "식만동",
            "죽동동", "봉림동", "송정동", "화전동", "녹산동", "생곡동",
            "구랑동", "지사동", "미음동", "범방동", "신호동", "동선동",
            "성북동", "눌차동", "천성동", "대항동"
        ],
        "연제구": [
            "거제동", "연산동"
        ],
        "수영구": [
            "망미동", "수영동", "민락동", "광안동", "남천동"
        ],
        "사상구": [
            "삼락동", "모라동", "덕포동", "괘법동", "감전동", "주례동",
            "학장동", "엄궁동"
        ],
        "기장군": [
            "기장읍", "장안읍", "정관읍", "일광읍", "철마면"
        ]
    },
    "대구": {
        "중구": [
            "동인동1가", "동인동2가", "동인동3가", "동인동4가", "삼덕동1가", "삼덕동2가", "삼덕동3가", "봉산동",
            "장관동", "상서동", "수동", "덕산동", "종로1가", "종로2가", "사일동", "동일동", "남일동", "전동",
            "동성로3가", "동문동", "문화동", "공평동", "동성로2가", "태평로1가", "교동", "용덕동", "상덕동",
            "완전동", "도원동", "수창동", "태평로3가", "인교동", "서야동", "서성로1가", "시장북로", "하서동",
            "남성로", "계산동1가", "계산동2가", "동산동", "서문로2가", "서성로2가", "포정동", "서문로1가",
            "서내동", "북성로2가", "대안동", "동성로1가", "태평로2가", "북성로1가", "화전동", "향촌동",
            "북내동", "대신동", "달성동", "남산동", "대봉동"
        ],
        "동구": [
            "신암동", "신천동", "효목동", "평광동", "봉무동", "불로동", "도동", "지저동", "입석동", "검사동",
            "방촌동", "둔산동", "부동", "신평동", "서호동", "동호동", "신기동", "율하동", "용계동", "율암동",
            "상매동", "매여동", "각산동", "신서동", "동내동", "괴전동", "금강동", "대림동", "사복동", "숙천동",
            "내곡동", "능성동", "진인동", "도학동", "백안동", "미곡동", "용수동", "신무동", "미대동", "내동",
            "신용동", "중대동", "송정동", "덕곡동", "지묘동"
        ],
        "서구": [
            "내당동", "비산동", "평리동", "상리동", "중리동", "이현동", "원대동1가", "원대동2가", "원대동3가"
        ],
        "남구": [
            "이천동", "봉덕동", "대명동"
        ],
        "북구": [
            "칠성동1가", "칠성동2가", "고성동1가", "고성동2가", "고성동3가", "침산동", "노원동1가", "노원동2가",
            "노원동3가", "대현동", "산격동", "복현동", "검단동", "동변동", "서변동", "조야동", "노곡동", "읍내동",
            "동호동", "학정동", "도남동", "국우동", "구암동", "동천동", "관음동", "태전동", "매천동", "팔달동",
            "금호동", "사수동", "연경동"
        ],
        "수성구": [
            "범어동", "만촌동", "수성동1가", "수성동2가", "수성동3가", "수성동4가", "황금동", "중동", "상동",
            "파동", "두산동", "지산동", "범물동", "시지동", "매호동", "성동", "사월동", "신매동", "욱수동",
            "노변동", "삼덕동", "연호동", "이천동", "고모동", "가천동", "대흥동"
        ],
        "달서구": [
            "성당동", "두류동", "파호동", "호림동", "갈산동", "신당동", "이곡동", "장동", "장기동", "용산동",
            "죽전동", "감삼동", "본리동", "상인동", "도원동", "진천동", "유천동", "대천동", "월성동", "월암동",
            "송현동", "대곡동", "본동", "호산동"
        ],
        "달성군": [
            "화원읍", "논공읍", "다사읍", "유가읍", "옥포읍", "현풍읍", "가창면", "하빈면", "구지면"
        ]
    },
    "인천": {
        "중구": [
            "중앙동1가", "중앙동2가", "중앙동3가", "중앙동4가", "해안동1가", "해안동2가", "해안동3가", "해안동4가",
            "관동1가", "관동2가", "관동3가", "항동1가", "항동2가", "항동3가", "항동4가", "항동5가", "항동6가",
            "항동7가", "송학동1가", "송학동2가", "송학동3가", "사동", "신생동", "신포동", "답동", "신흥동1가",
            "신흥동2가", "신흥동3가", "선화동", "유동", "율목동", "도원동", "내동", "경동", "용동", "인현동",
            "전동", "북성동1가", "북성동2가", "북성동3가", "선린동", "송월동1가", "송월동2가", "송월동3가",
            "중산동", "운남동", "운서동", "운북동", "을왕동", "남북동", "덕교동", "무의동"
        ],
        "동구": [
            "만석동", "화수동", "송현동", "화평동", "창영동", "금곡동", "송림동"
        ],
        "미추홀구": [
            "숭의동", "용현동", "학익동", "도화동", "주안동", "관교동", "문학동"
        ],
        "연수구": [
            "옥련동", "선학동", "연수동", "청학동", "동춘동", "송도동"
        ],
        "남동구": [
            "구월동", "간석동", "만수동", "장수동", "서창동", "운연동", "남촌동", "수산동", "도림동",
            "논현동", "고잔동"
        ],
        "부평구": [
            "부평동", "십정동", "산곡동", "청천동", "삼산동", "갈산동", "부개동", "일신동", "구산동"
        ],
        "계양구": [
            "효성동", "계산동", "작전동", "서운동", "임학동", "용종동", "병방동", "방축동", "박촌동", "동양동",
            "귤현동", "상야동", "하야동", "평동", "노오지동", "선주지동", "이화동", "오류동", "갈현동", "둑실동",
            "목상동", "다남동", "장기동"
        ],
        "서구": [
            "백석동", "시천동", "검암동", "경서동", "공촌동", "연희동", "심곡동", "가정동", "신현동", "석남동",
            "원창동", "가좌동", "마전동", "당하동", "원당동", "대곡동", "금곡동", "오류동", "왕길동", "불로동",
            "청라동"
        ],
        "강화군": [
            "강화읍", "선원면", "불은면", "길상면", "화도면", "양도면", "내가면", "하점면", "양사면", "송해면",
            "교동면", "삼산면", "서도면"
        ],
        "옹진군": [
            "북도면", "백령면", "대청면", "덕적면", "영흥면", "자월면", "연평면"
        ]
    } ,
    "광주": {
        "동구": [
            "대인동", "금남로5가", "충장로5가", "수기동", "대의동", "궁동", "장동", "동명동",
            "계림동", "산수동", "지산동", "남동", "광산동", "금동", "호남동", "불로동",
            "황금동", "서석동", "소태동", "용연동", "운림동", "학동", "월남동", "선교동",
            "내남동", "용산동", "충장로1가", "충장로2가", "충장로3가", "충장로4가", "금남로1가",
            "금남로2가", "금남로3가", "금남로4가"
        ],
        "서구": [
            "양동", "농성동", "광천동", "유촌동", "덕흥동", "쌍촌동", "화정동", "치평동",
            "내방동", "서창동", "세하동", "용두동", "풍암동", "벽진동", "금호동", "마륵동",
            "매월동", "동천동"
        ],
        "남구": [
            "사동", "구동", "서동", "월산동", "백운동", "주월동", "노대동", "진월동",
            "덕남동", "행암동", "임암동", "송하동", "양림동", "방림동", "봉선동", "구소동",
            "양촌동", "도금동", "승촌동", "지석동", "압촌동", "화장동", "칠석동", "석정동",
            "신장동", "양과동", "이장동", "대지동", "원산동", "월성동"
        ],
        "북구": [
            "중흥동", "유동", "누문동", "북동", "임동", "신안동", "용봉동", "동림동",
            "운암동", "우산동", "풍향동", "문흥동", "각화동", "두암동", "오치동", "삼각동",
            "매곡동", "충효동", "덕의동", "금곡동", "망월동", "청풍동", "화암동", "장등동",
            "운정동", "본촌동", "일곡동", "양산동", "연제동", "신용동", "용두동", "지야동",
            "태령동", "수곡동", "효령동", "용전동", "용강동", "생용동", "월출동", "대촌동",
            "오룡동"
        ],
        "광산구": [
            "송정동", "도산동", "도호동", "신촌동", "서봉동", "운수동", "선암동", "소촌동",
            "우산동", "황룡동", "박호동", "비아동", "도천동", "수완동", "월계동", "쌍암동",
            "산월동", "신창동", "신가동", "운남동", "안청동", "진곡동", "장덕동", "흑석동",
            "하남동", "장수동", "산정동", "월곡동", "등임동", "산막동", "고룡동", "신룡동",
            "두정동", "임곡동", "광산동", "오산동", "사호동", "하산동", "유계동", "본덕동",
            "용봉동", "요기동", "복룡동", "송대동", "옥동", "월전동", "장록동", "송촌동",
            "지죽동", "용동", "용곡동", "지정동", "명화동", "동산동", "연산동", "도덕동",
            "송산동", "지평동", "오운동", "삼거동", "양동", "내산동", "대산동", "송학동",
            "신동", "삼도동", "남산동", "송치동", "산수동", "선동", "지산동", "왕동", "북산동",
            "명도동", "동호동", "덕림동", "양산동", "동림동", "오선동"
        ]
    },
    "울산": {
        "중구": [
            "학성동", "학산동", "복산동", "북정동", "옥교동", "성남동", "교동", "우정동",
            "성안동", "유곡동", "태화동", "다운동", "동동", "서동", "남외동", "장현동",
            "약사동", "반구동"
        ],
        "남구": [
            "무거동", "옥동", "두왕동", "신정동", "달동", "삼산동", "여천동", "야음동",
            "선암동", "상개동", "부곡동", "고사동", "성암동", "황성동", "용연동",
            "남화동", "용잠동", "장생포동", "매암동"
        ],
        "동구": [
            "방어동", "화정동", "일산동", "전하동", "미포동", "주전동", "동부동", "서부동"
        ],
        "북구": [
            "창평동", "호계동", "매곡동", "가대동", "신천동", "중산동", "상안동",
            "천곡동", "달천동", "시례동", "무룡동", "구유동", "정자동", "신명동",
            "대안동", "당사동", "신현동", "산하동", "어물동", "명촌동", "진장동",
            "연암동", "효문동", "양정동", "화봉동", "송정동", "염포동"
        ],
        "울주군": {
            "온산읍": [
                "화산리", "삼평리", "강양리", "우봉리", "당월리", "처용리", "산암리",
                "대정리", "방도리", "이진리", "원산리", "덕신리", "학남리"
            ],
            "언양읍": [
                "반송리", "반천리", "반곡리", "어음리", "송대리", "평리", "다개리",
                "대곡리", "직동리", "동부리", "서부리", "남부리", "반연리", "태기리",
                "구수리"
            ],
            "온양읍": [
                "발리", "대안리", "망양리", "남창리", "동상리", "삼광리", "내광리",
                "외광리", "운화리", "고산리"
            ],
            "범서읍": [
                "사연리", "천상리", "입암리", "굴화리", "서사리", "두산리", "구영리",
                "중리", "망성리", "척과리"
            ],
            "청량읍": [
                "덕하리", "동천리", "상남리", "개곡리", "중리", "문죽리", "삼정리",
                "율리", "용암리"
            ],
            "삼남읍": [
                "교동리", "상천리", "신화리", "방기리", "가천리"
            ],
            "서생면": [
                "신암리", "명산리", "나사리", "화산리", "대송리", "용리", "서생리",
                "진하리", "화정리", "위양리"
            ],
            "웅촌면": [
                "초천리", "석천리", "곡천리", "검단리", "은현리", "고연리", "대대리",
                "통천리", "대복리"
            ],
            "두동면": [
                "만화리", "구미리", "월평리", "삼정리", "이전리", "봉계리", "천전리",
                "은편리"
            ],
            "두서면": [
                "차리", "구량리", "복안리", "미호리", "활천리", "내와리", "전읍리",
                "인보리", "서하리"
            ],
            "상북면": [
                "지내리", "양등리", "산전리", "길천리", "이천리", "덕현리", "명촌리",
                "천전리", "거리", "궁근정리", "향산리", "소호리", "등억알프스리"
            ],
            "삼동면": [
                "둔기리", "조일리", "출강리", "작동리", "보은리", "하잠리", "금곡리"
            ]
        }
    },
    "대전": {
        "동구": [
            "원동", "인동", "효동", "천동", "가오동", "신흥동", "판암동", "삼정동", "용운동",
            "대동", "자양동", "신안동", "소제동", "가양동", "용전동", "성남동", "홍도동", "삼성동",
            "정동", "중동", "추동", "비룡동", "주산동", "용계동", "마산동", "효평동", "직동", "세천동",
            "신상동", "신하동", "신촌동", "사성동", "내탑동", "오동", "주촌동", "낭월동", "대별동",
            "이사동", "대성동", "장척동", "소호동", "구도동", "삼괴동", "상소동", "하소동"
        ],
        "중구": [
            "은행동", "선화동", "목동", "중촌동", "대흥동", "문창동", "석교동", "호동", "옥계동",
            "대사동", "부사동", "용두동", "오류동", "태평동", "유천동", "문화동", "산성동", "사정동",
            "안영동", "무수동", "구완동", "침산동", "목달동", "정생동", "어남동", "금동"
        ],
        "서구": [
            "복수동", "변동", "도마동", "정림동", "용문동", "탄방동", "괴정동", "가장동", "내동",
            "갈마동", "둔산동", "월평동", "가수원동", "도안동", "관저동", "흑석동", "매노동", "산직동",
            "장안동", "평촌동", "오동", "우명동", "원정동", "용촌동", "봉곡동", "괴곡동", "만년동"
        ],
        "유성구": [
            "원내동", "교촌동", "대정동", "용계동", "학하동", "계산동", "성북동", "세동", "송정동",
            "방동", "봉명동", "구암동", "덕명동", "원신흥동", "상대동", "복용동", "장대동", "갑동",
            "노은동", "지족동", "죽동", "궁동", "어은동", "구성동", "신성동", "가정동", "도룡동",
            "장동", "방현동", "화암동", "덕진동", "하기동", "추목동", "자운동", "신봉동", "수남동",
            "안산동", "외삼동", "반석동", "문지동", "전민동", "원촌동", "탑립동", "용산동",
            "봉산동", "관평동", "송강동", "금고동", "대동", "금탄동", "신동", "둔곡동", "구룡동"
        ],
        "대덕구": [
            "오정동", "대화동", "읍내동", "연축동", "신대동", "와동", "송촌동", "법동", "중리동",
            "비래동", "석봉동", "목상동", "문평동", "신일동", "덕암동", "상서동", "평촌동", "장동",
            "용호동", "이현동", "갈전동", "부수동", "황호동", "삼정동", "미호동", "신탄진동"
        ]
    },
    "경기도": {
        "원미구": [],
        "권선구": [],
        "일산동구": [],
        "분당구": [],
        "일산서구": [],
        "기흥구": [],
        "상록구": [],
        "장안구": [],
        "단원구": [],
        "소사구": [],
        "중원구": [],
        "덕양구": [],
        "수정구": [],
        "동안구": [],
        "수지구": [],
        "처인구": [],
        "만안구": [],
        "영통구": [],
        "오정구": [],
        "팔달구": []
        },
    "경상북도": {
        "포항시": [],
        "경주시": [],
        "김천시": [],
        "안동시": [],
        "구미시": [],
        "영주시": [],
        "영천시": [],
        "상주시": [],
        "문경시": [],
        "경산시": [],
        "의성군": [],
        "청송군": [],
        "영양군": [],
        "영덕군": [],
        "청도군": [],
        "고령군": [],
        "성주군": [],
        "칠곡군": [],
        "예천군": [],
        "봉화군": [],
        "울진군": [],
        "울릉군": []
    },
    "전라북도": {
        "전주시": [],
        "익산시": [],
        "군산시": [],
        "정읍시": [],
        "김제시": [],
        "남원시": [],
        "완주군": [],
        "고창군": [],
        "부안군": [],
        "임실군": [],
        "순창군": [],
        "진안군": [],
        "무주군": [],
        "장수군": []
    },
    "경상남도": {
        "마산합포구": [],
        "마산회원구": [],
        "성산구": [],
        "의창구": [],
        "진해구": []
    },
    "전라남도": {
        "목포시": [],
        "여수시": [],
        "순천시": [],
        "나주시": [],
        "광양시": [],
        "담양군": [],
        "곡성군": [],
        "구례군": [],
        "고흥군": [],
        "보성군": [],
        "화순군": [],
        "장흥군": [],
        "강진군": [],
        "해남군": [],
        "영암군": [],
        "무안군": [],
        "함평군": [],
        "영광군": [],
        "장성군": [],
        "완도군": [],
        "진도군": [],
        "신안군": []
    },
    "강원도": {
        "원주시": [],
        "춘천시": [],
        "강릉시": [],
        "동해시": [],
        "속초시": [],
        "삼척시": [],
        "태백시": [],
        "홍천군": [],
        "철원군": [],
        "횡성군": [],
        "평창군": [],
        "정선군": [],
        "영월군": [],
        "인제군": [],
        "고성군": [],
        "양양군": [],
        "화천군": [],
        "양구군": []
    },
    "충청북도": {
        "청주시": [],
        "충주시": [],
        "제천시": [],
        "보은군": [],
        "옥천군": [],
        "영동군": [],
        "증평군": [],
        "진천군": [],
        "괴산군": [],
        "음성군": [],
        "단양군": []
    },
    "제주도": {},
    "충청남도": {
        "천안시": [],
        "공주시": [],
        "보령시": [],
        "아산시": [],
        "서산시": [],
        "논산시": [],
        "계룡시": [],
        "당진시": [],
        "금산군": [],
        "부여군": [],
        "서천군": [],
        "청양군": [],
        "홍성군": [],
        "예산군": [],
        "태안군": []
    },
    "세종":{}
}

def extract_region_specific(keywords, korea_data):
    extracted_results = []
    found = False

    # Step 1: 동 검색 우선
    for 광역시, 구들 in korea_data.items():
        for 구, 동리스트 in 구들.items():
            for 동 in 동리스트:
                if 동 in keywords:
                    extracted_results.append({"광역시": 광역시, "구": 구, "동": 동})
                    found = True
                    break
            if found:
                break
        if found:
            break

    if not found:  # Step 2: 광역시와 구 확인
        for 광역시, 구들 in korea_data.items():
            if 광역시 in keywords:
                for 구 in 구들.keys():
                    if 구 in keywords:
                        extracted_results.append({"광역시": 광역시, "구": 구})
                        found = True
                        break
                if found:
                    break
                extracted_results.append({"광역시": 광역시})
                found = True
                break

    # Step 3: 구 이름만 입력된 경우 해당 구가 있는 모든 광역시 리스트 반환
    if not found:
        for 광역시, 구들 in korea_data.items():
            for 구 in 구들.keys():
                if 구 in keywords:
                    extracted_results.append({"광역시": 광역시, "구": 구})

    return extracted_results

def extract_remaining_keywords(query, region_results, korea_data):
    # 지역 관련 키워드를 추출
    region_keywords = set()
    for region in region_results:
        for value in region.values():
            if isinstance(value, list):  # 리스트일 경우 개별 요소로 추가
                region_keywords.update(value)
            else:
                region_keywords.add(value)

    # 모든 지역 데이터를 flatten해서 확인
    all_regions = set()
    for 광역시, 구들 in korea_data.items():
        all_regions.add(광역시)
        for 구, 동리스트 in 구들.items():
            all_regions.add(구)
            all_regions.update(동리스트)

    # 검색어에서 지역명 제거
    remaining_query = " ".join([word for word in query.split() if word not in all_regions and word not in region_keywords])

    return remaining_query
  

@app.route('/embed', methods=['POST'])
def embed():
    # JSON에서 'query' 키 추출
    query = request.args.get('query', '')


    if not query:
        return jsonify({'error': 'No query provided'}), 400

    # 형태소 분석 및 지역 추출
    keywords = okt.nouns(query)
    region_results = extract_region_specific(keywords, korea_data)
    remaining_query = extract_remaining_keywords(query, region_results, korea_data)

    # 광역시 이름 변환
    # 연결된 지역명과 나머지 키워드 결합
    connected_regions = ", ".join(
        [f"{region.get('광역시', '')} {region.get('구', '')} {region.get('동', '')}".strip() for region in region_results]
    )
    embedding = model.encode(remaining_query).tolist()

    # 결과 반환
    return jsonify({
        'regions': connected_regions,
        'remaining_keywords': remaining_query,
        'embedding': embedding
    })
    
if __name__ == '__main__':  
   app.run('0.0.0.0',port=5010,debug=True)
